package lab.pawigor.step2_1_12;

/**
 * Created by z on 28.09.15.
 * <p>
 * Найдите эйлеров цикл в графе.
 * <p>
 * Формат входных данных:
 * В первой строке указаны два числа разделенных пробелом: v (число вершин) и e (число ребер). В следующих e строках
 * указаны пары вершин, соединенных ребром. Выполняются ограничения: 2≤v≤1000,0≤e≤1000 .
 * <p>
 * Формат выходных данных:
 * Одно слово: NONE, если в графе нет эйлерова цикла, или список вершин в порядке обхода эйлерова цикла, если он есть.
 * <p>
 * Sample Input 1:
 * <p>
 * 4 2
 * 1 2
 * 3 2
 * <p>
 * Sample Output 1:
 * <p>
 * NONE
 * <p>
 * <p>
 * Sample Input 2:
 * <p>
 * 3 3
 * 1 2
 * 2 3
 * 3 1
 * <p>
 * Sample Output 2:
 * <p>
 * 1 2 3
 */
public class Main {
}
